"""
第12-13天

任务
    解析DNS协议报文

参考资料
    DNS协议详解及报文格式分析：DNS协议详解及报文格式分析 - 程序员大本营

作业
    编程解析第8-9天的pcap文件，遍历文件中的所有数据包，打印所有DNS协议
    数据包时间、长度信息、源MAC地址、目的MAC地址、源IP地址、目的IP地址
    、源端口、目的端口、DNS请求/响应、查询的域名、解析的结果（响应包，如果有多个，用逗号拼在一起）

示例
总计124个数据包：
[2022-01-12 15:00:01] 548Bytes 3C-5A-20-1B-7F-00 6D-47-5E-2A-6C-9A
    192.168.1.100 192.168.1.2 5000 53 DNS请求 www.baidu.com
[2022-01-12 15:00:03] 1024Bytes 3C-5A-20-1B-7F-00 6D-47-5E-2A-6C-9A
    192.168.1.100 192.168.1.4 32006 67 DNS响应 www.qq.com 125.56.75.20
······
最后输出域名和IP地址的映射表：
域名  IP地址
www.baidu.com 220.196.14.25
www.qq.com 156.254.36.10
······

完结版依赖项目的版本： 66bd64a052d89e10463b785ff10bee42537cfa54
（有对项目内其他模块的依赖，记录下版本，方便以后运行）
"""
# 如果不是在 Pycharm 里，打开下面三行注释
# import os
# import sys
# sys.path.append(os.path.dirname(os.path.dirname(os.path.abspath(__file__))))

import mmap

from protocol.dns import Dns
from protocol.ip import Ipv4, Ipv6
from protocol.pcap import Pcap
from protocol.tcp import Tcp
from protocol.udp import Udp
from utils.convert import ip2str


def main(mmap_obj: mmap.mmap):
    pcap = Pcap(item_api=mmap_obj, total_len=mmap_obj.size())

    # 遍历 Packet 寻找 DNS 报文
    for packet in pcap.iterate_packet():
        ip = packet.parse_payload()
        if not isinstance(ip, (Ipv4, Ipv6)):  # 必须是 IPv4、IPv6
            continue
        tcp_udp = ip.parse_payload()
        if not isinstance(tcp_udp, (Tcp, Udp)):  # 必须是 TCP/UDP
            continue
        dns = tcp_udp.parse_payload()
        if not isinstance(dns, Dns):  # 必须是 DNS
            continue

        # 依次输出 Packet、IP、TCP/UDP、DNS
        print(packet.show())
        print(ip.show("", tab_cnt=1))
        print(tcp_udp.show(tab_cnt=2))
        print(dns.show(tab_cnt=3))
        print("-" * 100)

    # 输出所有的 DNS 缓存结果
    print("")
    print("域名".ljust(50), "IP地址")
    for domain, ip_address in Dns.iterate_cache_domain_address():
        print(domain.ljust(50), ip2str(ip_address))


if __name__ == "__main__":
    with open("data_day_12.pcap", "rb") as f:
        with mmap.mmap(f.fileno(), 0, access=mmap.ACCESS_READ) as m:
            main(m)

# 结果
# [2022-05-19 14:46:38]   77 Bytes  1C-69-7A-23-1C-DC  ->  38-AD-8E-6C-1D-21
# 	[IPv4] 10.92.81.7  ->  10.95.38.38
# 		[UDP] 53116  ->  53
# 			[DNS]查询	dnspod.qcloud.com
# ----------------------------------------------------------------------------------------------------
# [2022-05-19 14:46:38]  196 Bytes  38-AD-8E-6C-1D-21  ->  1C-69-7A-23-1C-DC
# 	[IPv4] 10.95.38.38  ->  10.92.81.7
# 		[UDP] 53  ->  53116
# 			[DNS]响应	dnspod.qcloud.com                ->  dnspod.qcloud.com.cdn.dnsv1.com
# 						dnspod.qcloud.com.cdn.dnsv1.com  ->  bo924alc.sched.sma.tdnsstic1.cn
# 						bo924alc.sched.sma.tdnsstic1.cn  ->  103.18.208.211
# 						bo924alc.sched.sma.tdnsstic1.cn  ->  103.18.208.225
# ----------------------------------------------------------------------------------------------------
# [2022-05-19 14:46:43]   77 Bytes  1C-69-7A-23-1C-DC  ->  38-AD-8E-6C-1D-21
# 	[IPv4] 10.92.81.7  ->  10.95.38.38
# 		[UDP] 49177  ->  53
# 			[DNS]查询	x.research.qq.com
# ----------------------------------------------------------------------------------------------------
# [2022-05-19 14:46:43]   77 Bytes  1C-69-7A-23-1C-DC  ->  38-AD-8E-6C-1D-21
# 	[IPv4] 10.92.81.7  ->  10.44.105.156
# 		[UDP] 49177  ->  53
# 			[DNS]查询	x.research.qq.com
# ----------------------------------------------------------------------------------------------------
# [2022-05-19 14:46:43]  141 Bytes  38-AD-8E-6C-1D-21  ->  1C-69-7A-23-1C-DC
# 	[IPv4] 10.44.105.156  ->  10.92.81.7
# 		[UDP] 53  ->  49177
# 			[DNS]响应	x.research.qq.com                   ->  ins-qw3q8ofk.ias.tencent-cloud.net
# 						ins-qw3q8ofk.ias.tencent-cloud.net  ->  42.187.183.82
# ----------------------------------------------------------------------------------------------------
# [2022-05-19 14:46:43]  141 Bytes  38-AD-8E-6C-1D-21  ->  1C-69-7A-23-1C-DC
# 	[IPv4] 10.95.38.38  ->  10.92.81.7
# 		[UDP] 53  ->  49177
# 			[DNS]响应	x.research.qq.com                   ->  ins-qw3q8ofk.ias.tencent-cloud.net
# 						ins-qw3q8ofk.ias.tencent-cloud.net  ->  42.187.183.82
# ----------------------------------------------------------------------------------------------------
# [2022-05-19 14:46:52]   91 Bytes  1C-69-7A-23-1C-DC  ->  38-AD-8E-6C-1D-21
# 	[IPv4] 10.92.81.7  ->  10.95.38.38
# 		[UDP] 52246  ->  53
# 			[DNS]查询	content-autofill.googleapis.com
# ----------------------------------------------------------------------------------------------------
# [2022-05-19 14:46:52]   91 Bytes  1C-69-7A-23-1C-DC  ->  38-AD-8E-6C-1D-21
# 	[IPv4] 10.92.81.7  ->  10.44.105.156
# 		[UDP] 52246  ->  53
# 			[DNS]查询	content-autofill.googleapis.com
# ----------------------------------------------------------------------------------------------------
# [2022-05-19 14:46:52]  107 Bytes  38-AD-8E-6C-1D-21  ->  1C-69-7A-23-1C-DC
# 	[IPv4] 10.44.105.156  ->  10.92.81.7
# 		[UDP] 53  ->  52246
# 			[DNS]响应	content-autofill.googleapis.com  ->  172.217.160.74
# ----------------------------------------------------------------------------------------------------
# [2022-05-19 14:46:52]  107 Bytes  38-AD-8E-6C-1D-21  ->  1C-69-7A-23-1C-DC
# 	[IPv4] 10.95.38.38  ->  10.92.81.7
# 		[UDP] 53  ->  52246
# 			[DNS]响应	content-autofill.googleapis.com  ->  142.251.43.10
# ----------------------------------------------------------------------------------------------------
# [2022-05-19 14:46:52]   75 Bytes  00-0C-29-7C-02-CA  ->  38-AD-8E-6C-1D-1B
# 	[IPv4] 10.92.53.51  ->  10.95.38.38
# 		[UDP] 50939  ->  53
# 			[DNS]查询	www.chengtu.com
# ----------------------------------------------------------------------------------------------------
# [2022-05-19 14:46:53]  143 Bytes  38-AD-8E-6C-1D-1B  ->  00-0C-29-7C-02-CA
# 	[IPv4] 10.95.38.38  ->  10.92.53.51
# 		[UDP] 53  ->  50939
# 			[DNS]响应	www.chengtu.com                         ->  www.chengtu.com.cname.yunjiasu-cdn.net
# 						www.chengtu.com.cname.yunjiasu-cdn.net  ->  150.138.151.65
# ----------------------------------------------------------------------------------------------------
# [2022-05-19 14:46:53]   77 Bytes  00-0C-29-7C-02-CA  ->  38-AD-8E-6C-1D-1B
# 	[IPv4] 10.92.53.51  ->  10.95.38.38
# 		[UDP] 62531  ->  53
# 			[DNS]查询	beian.miit.gov.cn
# ----------------------------------------------------------------------------------------------------
# [2022-05-19 14:46:53]   73 Bytes  00-0C-29-7C-02-CA  ->  38-AD-8E-6C-1D-1B
# 	[IPv4] 10.92.53.51  ->  10.95.38.38
# 		[UDP] 51015  ->  53
# 			[DNS]查询	discuz.qq.com
# ----------------------------------------------------------------------------------------------------
# [2022-05-19 14:46:53]   74 Bytes  00-0C-29-7C-02-CA  ->  38-AD-8E-6C-1D-1B
# 	[IPv4] 10.92.53.51  ->  10.95.38.38
# 		[UDP] 56963  ->  53
# 			[DNS]查询	cd.abbs.com.cn
# ----------------------------------------------------------------------------------------------------
# [2022-05-19 14:46:53]   89 Bytes  38-AD-8E-6C-1D-1B  ->  00-0C-29-7C-02-CA
# 	[IPv4] 10.95.38.38  ->  10.92.53.51
# 		[UDP] 53  ->  51015
# 			[DNS]响应	discuz.qq.com  ->  0.0.0.1
# ----------------------------------------------------------------------------------------------------
# [2022-05-19 14:46:53]   77 Bytes  00-0C-29-7C-02-CA  ->  38-AD-8E-6C-1D-1B
# 	[IPv4] 10.92.53.51  ->  10.95.38.38
# 		[UDP] 64965  ->  53
# 			[DNS]查询	ditie.chengtu.com
# ----------------------------------------------------------------------------------------------------
# [2022-05-19 14:46:53]  156 Bytes  38-AD-8E-6C-1D-1B  ->  00-0C-29-7C-02-CA
# 	[IPv4] 10.95.38.38  ->  10.92.53.51
# 		[UDP] 53  ->  62531
# 			[DNS]响应	beian.miit.gov.cn                  ->  23a72c571eab6919.cdn.jiashule.com
# 						23a72c571eab6919.cdn.jiashule.com  ->  116.211.155.219
# 						23a72c571eab6919.cdn.jiashule.com  ->  116.211.155.181
# ----------------------------------------------------------------------------------------------------
# [2022-05-19 14:46:53]   78 Bytes  00-0C-29-7C-02-CA  ->  38-AD-8E-6C-1D-1B
# 	[IPv4] 10.92.53.51  ->  10.95.38.38
# 		[UDP] 61295  ->  53
# 			[DNS]查询	meishi.chengtu.com
# ----------------------------------------------------------------------------------------------------
# [2022-05-19 14:46:53]  149 Bytes  38-AD-8E-6C-1D-1B  ->  00-0C-29-7C-02-CA
# 	[IPv4] 10.95.38.38  ->  10.92.53.51
# 		[UDP] 53  ->  61295
# 			[DNS]响应	meishi.chengtu.com                         ->  meishi.chengtu.com.cname.yunjiasu-cdn.net
# 						meishi.chengtu.com.cname.yunjiasu-cdn.net  ->  150.138.151.65
# ----------------------------------------------------------------------------------------------------
# [2022-05-19 14:46:53]   72 Bytes  00-0C-29-7C-02-CA  ->  38-AD-8E-6C-1D-1B
# 	[IPv4] 10.92.53.51  ->  10.95.38.38
# 		[UDP] 62909  ->  53
# 			[DNS]查询	www.12377.cn
# ----------------------------------------------------------------------------------------------------
# [2022-05-19 14:46:53]  141 Bytes  38-AD-8E-6C-1D-1B  ->  00-0C-29-7C-02-CA
# 	[IPv4] 10.95.38.38  ->  10.92.53.51
# 		[UDP] 53  ->  56963
# 			[DNS]响应	cd.abbs.com.cn                         ->  cd.abbs.com.cn.cname.yunjiasu-cdn.net
# 						cd.abbs.com.cn.cname.yunjiasu-cdn.net  ->  123.207.48.106
# ----------------------------------------------------------------------------------------------------
# [2022-05-19 14:46:53]   78 Bytes  00-0C-29-7C-02-CA  ->  38-AD-8E-6C-1D-1B
# 	[IPv4] 10.92.53.51  ->  10.95.38.38
# 		[UDP] 52102  ->  53
# 			[DNS]查询	www.cdjubao.gov.cn
# ----------------------------------------------------------------------------------------------------
# [2022-05-19 14:46:54]   94 Bytes  38-AD-8E-6C-1D-1B  ->  00-0C-29-7C-02-CA
# 	[IPv4] 10.95.38.38  ->  10.92.53.51
# 		[UDP] 53  ->  52102
# 			[DNS]响应	www.cdjubao.gov.cn  ->  125.70.9.173
# ----------------------------------------------------------------------------------------------------
# [2022-05-19 14:46:54]   76 Bytes  00-0C-29-7C-02-CA  ->  38-AD-8E-6C-1D-1B
# 	[IPv4] 10.92.53.51  ->  10.95.38.38
# 		[UDP] 51529  ->  53
# 			[DNS]查询	www.cdnet110.com
# ----------------------------------------------------------------------------------------------------
# [2022-05-19 14:46:54]  239 Bytes  38-AD-8E-6C-1D-1B  ->  00-0C-29-7C-02-CA
# 	[IPv4] 10.95.38.38  ->  10.92.53.51
# 		[UDP] 53  ->  62909
# 			[DNS]响应	www.12377.cn                      ->  www.12377.cn.cdn.dnsv1.com.cn
# 						www.12377.cn.cdn.dnsv1.com.cn     ->  3z4qr0nn.slt-dk.sched.tdnsv8.com
# 						3z4qr0nn.slt-dk.sched.tdnsv8.com  ->  36.99.68.110
# 						3z4qr0nn.slt-dk.sched.tdnsv8.com  ->  150.138.190.106
# 						3z4qr0nn.slt-dk.sched.tdnsv8.com  ->  1.183.73.124
# 						3z4qr0nn.slt-dk.sched.tdnsv8.com  ->  42.81.15.106
# 						3z4qr0nn.slt-dk.sched.tdnsv8.com  ->  42.81.86.200
# ----------------------------------------------------------------------------------------------------
# [2022-05-19 14:46:54]   92 Bytes  38-AD-8E-6C-1D-1B  ->  00-0C-29-7C-02-CA
# 	[IPv4] 10.95.38.38  ->  10.92.53.51
# 		[UDP] 53  ->  51529
# 			[DNS]响应	www.cdnet110.com  ->  171.221.172.84
# ----------------------------------------------------------------------------------------------------
# [2022-05-19 14:46:54]  132 Bytes  38-AD-8E-6C-1D-1B  ->  00-0C-29-7C-02-CA
# 	[IPv4] 10.95.38.38  ->  10.92.53.51
# 		[UDP] 53  ->  64965
# 			[DNS]响应	ditie.chengtu.com             ->  20190314218552.yunhaiweb.com
# 						20190314218552.yunhaiweb.com  ->  212.64.34.131
# ----------------------------------------------------------------------------------------------------
# [2022-05-19 14:46:54]   91 Bytes  00-0C-29-7C-02-CA  ->  38-AD-8E-6C-1D-1B
# 	[IPv4] 10.92.53.51  ->  10.95.38.38
# 		[UDP] 50630  ->  53
# 			[DNS]查询	content-autofill.googleapis.com
# ----------------------------------------------------------------------------------------------------
# [2022-05-19 14:46:54]  107 Bytes  38-AD-8E-6C-1D-1B  ->  00-0C-29-7C-02-CA
# 	[IPv4] 10.95.38.38  ->  10.92.53.51
# 		[UDP] 53  ->  50630
# 			[DNS]响应	content-autofill.googleapis.com  ->  142.251.43.10
# ----------------------------------------------------------------------------------------------------
# [2022-05-19 14:46:57]   95 Bytes  00-0C-29-7C-02-CA  ->  38-AD-8E-6C-1D-1B
# 	[IPv4] 10.92.53.51  ->  10.95.38.38
# 		[UDP] 50029  ->  53
# 			[DNS]查询	optimizationguide-pa.googleapis.com
# ----------------------------------------------------------------------------------------------------
# [2022-05-19 14:46:57]  111 Bytes  38-AD-8E-6C-1D-1B  ->  00-0C-29-7C-02-CA
# 	[IPv4] 10.95.38.38  ->  10.92.53.51
# 		[UDP] 53  ->  50029
# 			[DNS]响应	optimizationguide-pa.googleapis.com  ->  142.251.43.10
# ----------------------------------------------------------------------------------------------------
#
# 域名                                                 IP地址
# dnspod.qcloud.com                                  103.18.208.225
# dnspod.qcloud.com.cdn.dnsv1.com                    103.18.208.225
# bo924alc.sched.sma.tdnsstic1.cn                    103.18.208.225
# x.research.qq.com                                  42.187.183.82
# ins-qw3q8ofk.ias.tencent-cloud.net                 42.187.183.82
# content-autofill.googleapis.com                    142.251.43.10
# www.chengtu.com                                    150.138.151.65
# www.chengtu.com.cname.yunjiasu-cdn.net             150.138.151.65
# discuz.qq.com                                      0.0.0.1
# beian.miit.gov.cn                                  116.211.155.181
# 23a72c571eab6919.cdn.jiashule.com                  116.211.155.181
# meishi.chengtu.com                                 150.138.151.65
# meishi.chengtu.com.cname.yunjiasu-cdn.net          150.138.151.65
# cd.abbs.com.cn                                     123.207.48.106
# cd.abbs.com.cn.cname.yunjiasu-cdn.net              123.207.48.106
# www.cdjubao.gov.cn                                 125.70.9.173
# www.12377.cn                                       42.81.86.200
# www.12377.cn.cdn.dnsv1.com.cn                      42.81.86.200
# 3z4qr0nn.slt-dk.sched.tdnsv8.com                   42.81.86.200
# www.cdnet110.com                                   171.221.172.84
# ditie.chengtu.com                                  212.64.34.131
# 20190314218552.yunhaiweb.com                       212.64.34.131
# optimizationguide-pa.googleapis.com                142.251.43.10
